In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame([4,8,15,16,23,42])

In [7]:
for i in df[0]:
    print(i)

4
8
15
16
23
42

In [8]:
data={'Name':["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

In [10]:
df1=pd.DataFrame(data)

df1

In [11]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Question 4

Dataframe can be seen as a 2dimensional array ,but series is a single level array .

# Question 5

In [12]:
df2=df1.iloc[:,0:1]

In [13]:
df2

     Name
0   Alice
1     Bob
2  Claire

In [15]:
df3=pd.DataFrame(data,index=["A","B","C"])

###

In [16]:
df3

     Name  Age  Gender
A   Alice   25  Female
B     Bob   30    Male
C  Claire   27  Female

In [17]:
df4=df1.drop(columns=["Name"])

In [18]:
df4

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

# 6

Series is immutable rest all are mutable

# 7

In [32]:
df5=pd.DataFrame(columns=[df1["Gender"],df1["Age"]])

In [29]:
df5

Empty DataFrame
Columns: [(Female, 25), (Male, 30), (Female, 27)]
Index: []